/*

버튼누르기

철수에게는 빨간색, 초록색, 파란색 세 개의 버튼이 있다. 버튼 하나를 누를 때 마다 특정 점수를 얻을 수 있으며, 철수는 1초에 한 번씩 버튼을 누를 수 있다. 

물론, 특정 시간에는 세 개의 버튼 중에서 한 개의 버튼만을 누를 수 있다. 

각 시간마다 특정 버튼을 눌렀을 때 얻는 점수는 모두 다를 수 있다. 

예를 들어, 시간 1에 빨간색, 초록색, 파란색 버튼에 대한 점수가 3, 5, 7 로 주어질 수 있다. 

이 경우에는 파란색을 누르는 것이 점수를 가장 많이 얻을 수 있다. 물론, 시간 2에 각 버튼에 대한 점수는 또 다를 수 있다. 

버튼을 누를 때에는 한 가지 규칙이 있는데, 연속하여 색깔이 같은 버튼을 두 번 누를 수 없다는 것이다. 

예를 들어, 시간 1에 초록색 버튼을 눌렀다면, 시간 2에는 초록색 버튼을 누를 수 없다. 

이와 같은 규칙으로 각 시간마다 버튼을 누른다고 할 때, 철수가 얻을 수 있는 점수의 최댓값을 출력하는 프로그램을 작성하시오.


입력

첫 번째 줄에 철수에게 주어진 시간 N이 주어진다. ( 1 ≤ N ≤ 100,000 ) 두 번째 줄부터 N개의 시간에 대하여 빨간색, 초록색, 파란색 버튼을 눌렀을 때 얻을 수 있는 점수가 주어진다.
 

출력

철수가 얻을 수 있는 점수의 최댓값을 출력한다.

*/

#include <stdio.h>

int main() {

  int N;
  int arr[100010][3];
  int sum[100010][3]={0,};
  int max=0;
  int i,j;
  
  scanf("%d", &N);
  
  for(int i=0;i<N;i++)
    for(int j=0;j<3;j++)
      scanf("%d", &arr[i][j]);
      
  sum[0][0] = arr[0][0];
  sum[0][1] = arr[0][1];
  sum[0][2] = arr[0][2];
  
  for(int i=1;i<N;i++)
  {
    if(sum[i-1][1] + arr[i][0] < sum[i-1][2] + arr[i][0])
      sum[i][0] = sum[i-1][2] + arr[i][0];
    else
      sum[i][0] = sum[i-1][1] + arr[i][0];
      
    if(sum[i-1][0] + arr[i][1] < sum[i-1][2] + arr[i][1])
      sum[i][1] = sum[i-1][2] + arr[i][1];
    else
      sum[i][1] = sum[i-1][0] + arr[i][1];
    
    if(sum[i-1][0] + arr[i][2] < sum[i-1][1] + arr[i][2])
      sum[i][2] = sum[i-1][1] + arr[i][2];
    else
      sum[i][2] = sum[i-1][0] + arr[i][2];
  }
  
  max = sum[N-1][2];
  
  if(max < sum[N-1][1])
    max = sum[N-1][1];
  
  if(max < sum[N-1][0])
    max = sum[N-1][0];
    
  printf("%d", max);
  
  
  
  return 0;
}